Revit 2026 API

# PlanViewPlane Enumeration

---

Locations where view range offsets can be specified.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PlanViewPlane
```
```vb
Public Enumeration PlanViewPlane
```
```cpp
public enum class PlanViewPlane
```
```fsharp
type PlanViewPlane
```

| Member name | Value | Description |
| --- | --- | --- |
| BottomClipPlane | 2 | Bottom Clip Plane |
| CutPlane | 0 | Cut Plane |
| TopClipPlane | 1 | Top Clip Plane |
| UnderlayBottom | 4 | Underlay Bottom Plane |
| ViewDepthPlane | 3 | View Depth Plane |

#### Reference

Autodesk.Revit.DB Namespace